doc/calc-ref.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-25 Mon 15:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calc Reference</title>
<meta name="author" content="David Yeung" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Calc Reference</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2925226">1. calc</a>
<ul>
<li><a href="#org9f0c836">1.1. (calc-load-everything)</a></li>
</ul>
</li>
<li><a href="#orga9cbc9a">2. Stack</a>
<ul>
<li><a href="#org5dd9b8c">2.1. Stack entry format</a></li>
<li><a href="#orga0c400b">2.2. (calc-get-stack-element)</a></li>
<li><a href="#org8e35e36">2.3. (calc-top)</a></li>
<li><a href="#org786e0d3">2.4. (calc-top-n)</a></li>
<li><a href="#org6e7c709">2.5. (calc-top-list)</a></li>
<li><a href="#org2edcac3">2.6. (calc-top-list-n)</a></li>
<li><a href="#org68012d8">2.7. (calc-pop-push-record-list)</a></li>
</ul>
</li>
<li><a href="#orgf9b6b7c">3. Formula</a>
<ul>
<li><a href="#org9c9e490">3.1. (math-common-constant-factor) manual</a></li>
<li><a href="#org3c1105b">3.2. (calc-encase-atoms) manual</a></li>
<li><a href="#orgab80cb0">3.3. (math-expr-contains) manual</a></li>
<li><a href="#org27d2632">3.4. (math-expr-contains-count) manual</a></li>
<li><a href="#org03cabde">3.5. (math-expr-depends) manual</a></li>
<li><a href="#org3a0ada3">3.6. (math-expr-contains-vars) manual</a></li>
<li><a href="#org82e2632">3.7. (math-expr-subst) manual</a></li>
<li><a href="#org36db4d6">3.8. (math-multi-subst) manual</a></li>
</ul>
</li>
<li><a href="#org4e5ffe3">4. Polynomials</a>
<ul>
<li><a href="#orgf2ee4af">4.1. (math-polynomial-p) manual</a></li>
<li><a href="#org8eada03">4.2. (math-is-polynomial) manual</a></li>
<li><a href="#orge1dd8c2">4.3. (math-polynomial-base) manual</a></li>
</ul>
</li>
<li><a href="#org58fe4b6">5. Simplification &amp; rewriting</a>
<ul>
<li><a href="#org7a8cc6f">5.1. (math-simplify-extended) manual</a></li>
<li><a href="#org31538e5">5.2. (math-defsimplify) manual</a></li>
<li><a href="#org569247f">5.3. (math-apply-rewrites) manual</a></li>
<li><a href="#org3cc7a11">5.4. (math-match-patterns) manual</a></li>
</ul>
</li>
<li><a href="#org60ed649">6. Solving</a>
<ul>
<li><a href="#orgd2e27a9">6.1. (math-solve-for) manual</a></li>
<li><a href="#org85cf828">6.2. (math-solve-eqn) manual</a></li>
<li><a href="#org7b24ab2">6.3. (math-solve-system) manual</a></li>
</ul>
</li>
<li><a href="#org1c5fc6c">7. Selection</a>
<ul>
<li><a href="#orgcb7f78a">7.1. (calc-prepare-selection) manual</a></li>
<li><a href="#orgc008489">7.2. (calc-find-selected-part) manual</a></li>
<li><a href="#org372a66e">7.3. (calc-find-sub-formula) manual</a></li>
<li><a href="#org3608845">7.4. (calc-locate-cursor-element)</a></li>
</ul>
</li>
<li><a href="#org811f16d">8. Display</a>
<ul>
<li><a href="#org1ac94c9">8.1. (math-format-value) manual</a></li>
<li><a href="#org101c201">8.2. (math-format-stack-value)</a></li>
<li><a href="#orge8c8f72">8.3. (calc-align-stack-window)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<style>
  body { font-family: sans-serif; line-height: 1.5; }
  h3 { margin-top: 40px; margin-bottom: 6px; }
  a { text-decoration: none; }
  code { padding: 3px 6px; background: hsl(48 56% 88% / 1); }
  pre { margin-left: 0; margin-right: 0; background: hsl(229 56% 92% / 1); }
  .outline-text-3 { padding: 10px 20px; background: hsl(0 0% 96% / 1); }
  #table-of-contents {
    position: fixed;
    top: 0;
    left: 0;
    width: 460px;
    height: 100vh;
    overflow-y: auto;
    padding: 20px;
    background: hsl(0 0% 97% / 1);
    border-right: 1px solid hsl(0 0% 88% / 1);
    box-sizing: border-box;
    font-size: 0.9em;
  }
  #table-of-contents h2 { margin-top: 0; font-size: 1.1em; }
  #table-of-contents ul { padding-left: 1.2em; }
  #content { margin-left: 500px; max-width: 880px; padding: 20px; }
</style>
<div id="outline-container-org2925226" class="outline-2">
<h2 id="org2925226"><span class="section-number-2">1.</span> calc</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9f0c836" class="outline-3">
<h3 id="org9f0c836"><span class="section-number-3">1.1.</span> (calc-load-everything)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>(calc-load-everything)</code>
</p>

<p>
Load all Calc extension modules. Ensures all Calc functions are available
before calling them programmatically.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-load-everything)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga9cbc9a" class="outline-2">
<h2 id="orga9cbc9a"><span class="section-number-2">2.</span> Stack</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5dd9b8c" class="outline-3">
<h3 id="org5dd9b8c"><span class="section-number-3">2.1.</span> Stack entry format</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Each element of <code>calc-stack</code> is a list <code>(formula lines selection)</code>:
</p>
<ul class="org-ul">
<li><code>car</code> / index 0 — the full formula (a Lisp s-expression)</li>
<li><code>nth 1</code> — display line count (integer); initialized to <code>1</code> on push, updated
to the actual rendered height by <code>math-format-stack-value</code> via <code>calc-count-lines</code>.
Used by <code>calc-substack-height</code> for cursor positioning.</li>
<li><code>nth 2</code> — active selection sub-formula, or <code>nil</code> if none</li>
</ul>

<p>
Plain integers are replaced with <code>(cplx n 0)</code> by <code>calc-prepare-selection</code>
so that duplicate small integers are distinct objects (<code>eq</code>-wise). They are
restored to plain numbers by <code>calc-normalize</code> on next use.
</p>

<p>
Stack level 1 is the top.
</p>
</div>
</div>
<div id="outline-container-orga0c400b" class="outline-3">
<h3 id="orga0c400b"><span class="section-number-3">2.2.</span> (calc-get-stack-element)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>(calc-get-stack-element X &amp;optional SEL-MODE)</code>
</p>

<p>
Low-level accessor. Given a raw stack entry <code>X</code>, return a part of it
according to <code>SEL-MODE</code>:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>SEL-MODE</code></th>
<th scope="col" class="org-left">returns</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>nil</code></td>
<td class="org-left">selection (<code>nth 2</code>) if active and <code>calc-use-selections</code>; else formula (<code>car</code>)</td>
</tr>

<tr>
<td class="org-left"><code>'entry</code></td>
<td class="org-left"><code>X</code> itself</td>
</tr>

<tr>
<td class="org-left"><code>'sel</code></td>
<td class="org-left"><code>(nth 2 x)</code> — the selection sub-expression</td>
</tr>

<tr>
<td class="org-left"><code>'full</code></td>
<td class="org-left"><code>(car x)</code> — full formula, ignoring selection</td>
</tr>

<tr>
<td class="org-left">other</td>
<td class="org-left"><code>calc-sel-error</code></td>
</tr>
</tbody>
</table>

<p>
Called internally by <code>calc-top</code> and <code>calc-top-list</code>; rarely needed directly.
</p>
</div>
</div>
<div id="outline-container-org8e35e36" class="outline-3">
<h3 id="org8e35e36"><span class="section-number-3">2.3.</span> (calc-top)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>(calc-top &amp;optional N SEL-MODE)</code>
</p>

<p>
Return the Nth stack entry (default 1 = top) according to <code>SEL-MODE</code>.
Does not normalize. Use <code>calc-top-n</code> if normalization is wanted.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-top 1)          ;; formula at top (selection-aware)
(calc-top 1 'full)    ;; full formula, ignoring any active selection
(calc-top 1 'sel)     ;; active selection sub-expression
(calc-top 1 'entry)   ;; raw entry: (formula priority selection)
</pre>
</div>
</div>
</div>
<div id="outline-container-org786e0d3" class="outline-3">
<h3 id="org786e0d3"><span class="section-number-3">2.4.</span> (calc-top-n)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>(calc-top-n &amp;optional N SEL-MODE)</code>
</p>

<p>
Like <code>calc-top</code>, but normalizes the result and checks it is complete.
Use when you need a canonical formula and don't mind the precision
round-trip that <code>calc-normalize</code> may introduce.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-top-n 1)  ;; normalized formula at top
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e7c709" class="outline-3">
<h3 id="org6e7c709"><span class="section-number-3">2.5.</span> (calc-top-list)</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>(calc-top-list &amp;optional N M SEL-MODE)</code>
</p>

<p>
Return a list of <code>N</code> entries starting at stack level <code>M</code> (default both 1),
in bottom-to-top order (level <code>M+N-1</code> first, level <code>M</code> last). Does not
normalize. <code>SEL-MODE</code> is the same as for <code>calc-top</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-top-list 2 1)  ;; top two entries, bottom-to-top order
</pre>
</div>
</div>
</div>
<div id="outline-container-org2edcac3" class="outline-3">
<h3 id="org2edcac3"><span class="section-number-3">2.6.</span> (calc-top-list-n)</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<code>(calc-top-list-n &amp;optional N M SEL-MODE)</code>
</p>

<p>
Like <code>calc-top-list</code>, but normalizes every entry.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-top-list-n 2 1)  ;; normalized top two entries
</pre>
</div>
</div>
</div>
