doc/calc-ref.org
** (calc-pop-push-record-list)
   =(calc-pop-push-record-list N PREFIX VALS &optional M SELS)=

   Replace =N= stack entries starting at level =M= (default 1) with =VALS=, and
   record the operation in the trail under =PREFIX=. The standard way to commit
   the result of a command: pop the inputs, push the result, leave a trail entry.

   - =N= — number of entries to pop.
   - =PREFIX= — trail label (string). If nil, no trail entry is recorded.
   - =VALS= — a list of formulas to push, or a single formula (auto-wrapped in
     a list). Pushed in order so the last element ends up at the top of the stack.
   - =M= — bottom-most stack level affected (default 1 = top).
   - =SELS= — optional list of selections paired with =VALS=.

   If =calc-any-selections= is set and =SELS= is nil, falls through to
   =calc-replace-selections= instead of popping. Signals if the stack does not
   contain =N + M - 1= entries.

   #+begin_src emacs-lisp :results silent
   ;; Pop 2, push their product, record under "mult"
   (calc-pop-push-record-list 2 "mult" (list (calcFunc-mul (calc-top 2 'full)
                                                           (calc-top 1 'full))))

   ;; Single-value form: VALS may be the formula itself
   (calc-pop-push-record-list 1 "double" (calcFunc-mul (calc-top 1 'full) 2))
   #+end_src

* Formula
** (math-common-constant-factor) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-common_002dconstant_002dfactor][manual]]
   =(math-common-constant-factor EXPR)=

   Returns the *constant* factor in =EXPR=.

   #+begin_src emacs-lisp :results silent
   (math-common-constant-factor '(+ (* 6 x) (* 4 y)))  ;; => 2
   (math-common-constant-factor '(+ (* 3 x) y))        ;; => 1
   #+end_src

** (calc-encase-atoms) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dencase_002datoms][manual]]
   =(calc-encase-atoms X)=

   Modifies =X= in-place (via =setcar=) so every sub-formula is a unique atom,
   using the =(cplx n 0)= trick from =calc-prepare-selection=.

   #+begin_src emacs-lisp :results silent
   (let ((x (list '+ 1 1)))
     (calc-encase-atoms x)
     x)  ;; => (+ (cplx 1 0) (cplx 1 0))  — two distinct objects
   #+end_src

** (math-expr-contains) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dcontains][manual]]
   =(math-expr-contains EXPR VAR)=

   Return non-nil if =VAR= occurs as a subexpression of =EXPR=. Uses =equal=
   (structural equality), unlike =calc-find-sub-formula= which uses =eq=. In
   =f(a, a)=, both =a=s are =equal= but not =eq=, so this function would
   find either.

   #+begin_src emacs-lisp :results silent
   (math-expr-contains '(+ x (* 2 y)) 'x)  ;; => t
   (math-expr-contains '(+ x (* 2 y)) 'z)  ;; => nil
   #+end_src

** (math-expr-contains-count) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dcontains_002dcount][manual]]
   =(math-expr-contains-count EXPR VAR)=

   Return the number of occurrences of =VAR= in =EXPR=, or nil if none.

   #+begin_src emacs-lisp :results silent
   (math-expr-contains-count '(+ x (* 2 x)) 'x)  ;; => 2
   (math-expr-contains-count '(+ x 1) 'z)         ;; => nil
   #+end_src

** (math-expr-depends) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002ddepends][manual]]
   =(math-expr-depends EXPR VAR)=

   Return true if =EXPR= and =VAR= share any variable.

   #+begin_src emacs-lisp :results silent
   (math-expr-depends '(+ x 1) 'y)  ;; => nil
   (math-expr-depends '(+ x y) 'y)  ;; => t
   #+end_src

** (math-expr-contains-vars) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dcontains_002dvars][manual]]
   =(math-expr-contains-vars EXPR)=

   Return true if =EXPR= contains any variables; nil if it contains only
   constants and functions with constant arguments.

   #+begin_src emacs-lisp :results silent
   (math-expr-contains-vars '(+ x 1))  ;; => t
   (math-expr-contains-vars '(+ 1 2))  ;; => nil
   #+end_src

** (math-expr-subst) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dsubst][manual]]
   =(math-expr-subst EXPR OLD NEW)=

   Return a copy of =EXPR= with all occurrences of =OLD= replaced by =NEW=.
   Handles lambda dummy variables correctly.

   #+begin_src emacs-lisp :results silent
   (math-expr-subst '(+ x (* 2 x)) 'x 5)  ;; => (+ 5 (* 2 5))
   #+end_src

** (math-multi-subst) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-multi_002dsubst][manual]]
   =(math-multi-subst EXPR OLD NEW)=

   Like =math-expr-subst=, but =OLD= and =NEW= are lists substituted
   simultaneously. If lists differ in length, trailing elements of the longer
   list are ignored.

   #+begin_src emacs-lisp :results silent
   ;; Swap x and y: sequential subst would give (+ y y), simultaneous gives (+ y x)
   (math-multi-subst '(+ x y) '(x y) '(y x))  ;; => (+ y x)
   #+end_src

* Polynomials
** (math-polynomial-p) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-polynomial_002dp][manual]]
   =(math-polynomial-p EXPR VAR)=

   Return the degree of =EXPR= as a polynomial in =VAR=, or nil if it is not
   a polynomial. Degree is the highest power of =VAR= in the expanded form. A
   constant expression (no =VAR=) has degree 0.

   #+begin_src emacs-lisp :results silent
   (math-polynomial-p '(+ (^ x 2) (* 3 x) 1) 'x)  ;; => 2
   (math-polynomial-p '(calcFunc-sin x) 'x)         ;; => nil
   #+end_src

