doc/calc-ref.html
<div id="outline-container-org68012d8" class="outline-3">
<h3 id="org68012d8"><span class="section-number-3">2.7.</span> (calc-pop-push-record-list)</h3>
<div class="outline-text-3" id="text-2-7">
<p>
<code>(calc-pop-push-record-list N PREFIX VALS &amp;optional M SELS)</code>
</p>

<p>
Replace <code>N</code> stack entries starting at level <code>M</code> (default 1) with <code>VALS</code>, and
record the operation in the trail under <code>PREFIX</code>. The standard way to commit
the result of a command: pop the inputs, push the result, leave a trail entry.
</p>

<ul class="org-ul">
<li><code>N</code> — number of entries to pop.</li>
<li><code>PREFIX</code> — trail label (string). If nil, no trail entry is recorded.</li>
<li><code>VALS</code> — a list of formulas to push, or a single formula (auto-wrapped in
a list). Pushed in order so the last element ends up at the top of the stack.</li>
<li><code>M</code> — bottom-most stack level affected (default 1 = top).</li>
<li><code>SELS</code> — optional list of selections paired with <code>VALS</code>.</li>
</ul>

<p>
If <code>calc-any-selections</code> is set and <code>SELS</code> is nil, falls through to
<code>calc-replace-selections</code> instead of popping. Signals if the stack does not
contain <code>N + M - 1</code> entries.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Pop 2, push their product, record under "mult"
(calc-pop-push-record-list 2 "mult" (list (calcFunc-mul (calc-top 2 'full)
                                                        (calc-top 1 'full))))

;; Single-value form: VALS may be the formula itself
(calc-pop-push-record-list 1 "double" (calcFunc-mul (calc-top 1 'full) 2))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf9b6b7c" class="outline-2">
<h2 id="orgf9b6b7c"><span class="section-number-2">3.</span> Formula</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9c9e490" class="outline-3">
<h3 id="org9c9e490"><span class="section-number-3">3.1.</span> (math-common-constant-factor) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-common_002dconstant_002dfactor">manual</a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>(math-common-constant-factor EXPR)</code>
</p>

<p>
Returns the <b>constant</b> factor in <code>EXPR</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-common-constant-factor '(+ (* 6 x) (* 4 y)))  ;; =&gt; 2
(math-common-constant-factor '(+ (* 3 x) y))        ;; =&gt; 1
</pre>
</div>
</div>
</div>
<div id="outline-container-org3c1105b" class="outline-3">
<h3 id="org3c1105b"><span class="section-number-3">3.2.</span> (calc-encase-atoms) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dencase_002datoms">manual</a></h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>(calc-encase-atoms X)</code>
</p>

<p>
Modifies <code>X</code> in-place (via <code>setcar</code>) so every sub-formula is a unique atom,
using the <code>(cplx n 0)</code> trick from <code>calc-prepare-selection</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(let ((x (list '+ 1 1)))
  (calc-encase-atoms x)
  x)  ;; =&gt; (+ (cplx 1 0) (cplx 1 0))  — two distinct objects
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab80cb0" class="outline-3">
<h3 id="orgab80cb0"><span class="section-number-3">3.3.</span> (math-expr-contains) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dcontains">manual</a></h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>(math-expr-contains EXPR VAR)</code>
</p>

<p>
Return non-nil if <code>VAR</code> occurs as a subexpression of <code>EXPR</code>. Uses <code>equal</code>
(structural equality), unlike <code>calc-find-sub-formula</code> which uses <code>eq</code>. In
<code>f(a, a)</code>, both <code>a=s are =equal</code> but not <code>eq</code>, so this function would
find either.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-expr-contains '(+ x (* 2 y)) 'x)  ;; =&gt; t
(math-expr-contains '(+ x (* 2 y)) 'z)  ;; =&gt; nil
</pre>
</div>
</div>
</div>
<div id="outline-container-org27d2632" class="outline-3">
<h3 id="org27d2632"><span class="section-number-3">3.4.</span> (math-expr-contains-count) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dcontains_002dcount">manual</a></h3>
<div class="outline-text-3" id="text-3-4">
<p>
<code>(math-expr-contains-count EXPR VAR)</code>
</p>

<p>
Return the number of occurrences of <code>VAR</code> in <code>EXPR</code>, or nil if none.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-expr-contains-count '(+ x (* 2 x)) 'x)  ;; =&gt; 2
(math-expr-contains-count '(+ x 1) 'z)         ;; =&gt; nil
</pre>
</div>
</div>
</div>
<div id="outline-container-org03cabde" class="outline-3">
<h3 id="org03cabde"><span class="section-number-3">3.5.</span> (math-expr-depends) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002ddepends">manual</a></h3>
<div class="outline-text-3" id="text-3-5">
<p>
<code>(math-expr-depends EXPR VAR)</code>
</p>

<p>
Return true if <code>EXPR</code> and <code>VAR</code> share any variable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-expr-depends '(+ x 1) 'y)  ;; =&gt; nil
(math-expr-depends '(+ x y) 'y)  ;; =&gt; t
</pre>
</div>
</div>
</div>
<div id="outline-container-org3a0ada3" class="outline-3">
<h3 id="org3a0ada3"><span class="section-number-3">3.6.</span> (math-expr-contains-vars) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dcontains_002dvars">manual</a></h3>
<div class="outline-text-3" id="text-3-6">
<p>
<code>(math-expr-contains-vars EXPR)</code>
</p>

<p>
Return true if <code>EXPR</code> contains any variables; nil if it contains only
constants and functions with constant arguments.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-expr-contains-vars '(+ x 1))  ;; =&gt; t
(math-expr-contains-vars '(+ 1 2))  ;; =&gt; nil
</pre>
</div>
</div>
</div>
<div id="outline-container-org82e2632" class="outline-3">
<h3 id="org82e2632"><span class="section-number-3">3.7.</span> (math-expr-subst) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-expr_002dsubst">manual</a></h3>
<div class="outline-text-3" id="text-3-7">
<p>
<code>(math-expr-subst EXPR OLD NEW)</code>
</p>

<p>
Return a copy of <code>EXPR</code> with all occurrences of <code>OLD</code> replaced by <code>NEW</code>.
Handles lambda dummy variables correctly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-expr-subst '(+ x (* 2 x)) 'x 5)  ;; =&gt; (+ 5 (* 2 5))
</pre>
</div>
</div>
</div>
<div id="outline-container-org36db4d6" class="outline-3">
<h3 id="org36db4d6"><span class="section-number-3">3.8.</span> (math-multi-subst) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-multi_002dsubst">manual</a></h3>
<div class="outline-text-3" id="text-3-8">
<p>
<code>(math-multi-subst EXPR OLD NEW)</code>
</p>

<p>
Like <code>math-expr-subst</code>, but <code>OLD</code> and <code>NEW</code> are lists substituted
simultaneously. If lists differ in length, trailing elements of the longer
list are ignored.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Swap x and y: sequential subst would give (+ y y), simultaneous gives (+ y x)
(math-multi-subst '(+ x y) '(x y) '(y x))  ;; =&gt; (+ y x)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4e5ffe3" class="outline-2">
<h2 id="org4e5ffe3"><span class="section-number-2">4.</span> Polynomials</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf2ee4af" class="outline-3">
<h3 id="orgf2ee4af"><span class="section-number-3">4.1.</span> (math-polynomial-p) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-polynomial_002dp">manual</a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>(math-polynomial-p EXPR VAR)</code>
</p>

<p>
Return the degree of <code>EXPR</code> as a polynomial in <code>VAR</code>, or nil if it is not
a polynomial. Degree is the highest power of <code>VAR</code> in the expanded form. A
constant expression (no <code>VAR</code>) has degree 0.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-polynomial-p '(+ (^ x 2) (* 3 x) 1) 'x)  ;; =&gt; 2
(math-polynomial-p '(calcFunc-sin x) 'x)         ;; =&gt; nil
</pre>
</div>
</div>
</div>
