doc/calc-ref.org
** (math-is-polynomial) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-is_002dpolynomial][manual]]
   =(math-is-polynomial EXPR VAR DEGREE LOOSE)=

   Return a coefficient list =(a0 a1 ... an)= for =a0 + a1*var + ... + an*var^n=,
   or nil if =EXPR= is not a polynomial in =VAR=. =DEGREE= caps the maximum
   accepted degree (recommended to avoid huge lists on inputs like =(x+1)^1000=).

   If =LOOSE= is non-nil, coefficients may themselves depend on =VAR= as long
   as they are not polynomials; never returns nil in loose mode.

   #+begin_src emacs-lisp :results silent
   (math-is-polynomial '(+ (* 2 x) 3) 'x nil nil)     ;; => (3 2)      i.e. 3 + 2x
   (math-is-polynomial '(+ (^ x 2) -1) 'x nil nil)    ;; => (-1 0 1)   i.e. -1 + x^2
   #+end_src

** (math-polynomial-base) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-polynomial_002dbase][manual]]
   =(math-polynomial-base EXPR PRED)=

   Return a variable in =EXPR= such that =EXPR= is a polynomial in it, or nil.
   For multivariate expressions, the choice is arbitrary. =PRED=, if given, is
   called as =(pred subexpr)= with =mpb-top-expr= bound to the original =EXPR=;
   use it to add extra conditions or collect all suitable subexpressions.

   #+begin_src emacs-lisp :results silent
   (math-polynomial-base '(+ (^ x 2) (* 3 x)) nil)  ;; => x
   #+end_src

* Simplification & rewriting
** (math-simplify-extended) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-simplify_002dextended][manual]]
   =(math-simplify-extended A)=

   Simplify =A= with additional rules that are more thorough but not always
   safe (e.g., simplifies =sqrt(x^2)= to =x=, valid only when =x= is positive).
   Implemented by binding =math-living-dangerously= to =t= and calling
   =math-simplify=. Dangerous rules check this variable before firing.

   #+begin_src emacs-lisp :results silent
   (math-simplify-extended '(calcFunc-sqrt (^ x 2)))  ;; => x
   #+end_src

** (math-defsimplify) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-math_002ddefsimplify][manual]]
   =(math-defsimplify FUNCS BODY)=

   Macro that registers a simplification rule, typically as a top-level form.
   =FUNCS= is a symbol (e.g., =+=, =calcFunc-sqrt=) or list of symbols; the
   rule applies to calls to any of those functions. =BODY= is written as a
   function body with =expr= bound to the matched call.

   Return nil or the original =expr= to skip; any other value replaces =expr=.
   Rules are tried in definition order; the first match wins and restarts the
   loop. =BODY= must be plain Lisp — =defmath= conveniences are not available.
   The arguments of the matched call are already simplified before the rule
   runs, and may be rearranged destructively.

   #+begin_src emacs-lisp :results silent
   ;; arcsinh(-x) => -arcsinh(x)
   (math-defsimplify calcFunc-arcsinh
     (and (math-looks-negp (nth 1 expr))
          (math-neg (list 'calcFunc-arcsinh (math-neg (nth 1 expr))))))
   #+end_src

** (math-apply-rewrites) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-apply_002drewrites][manual]]
   =(math-apply-rewrites EXPR CRULES HEADS)=

   Apply compiled rewrite rule set =CRULES= to =EXPR= at the top level only,
   making at most one rewrite. Returns the rewritten expression, or nil if no
   rule matched or produced a change. =HEADS= is optional: a list of function
   names in =EXPR= used to narrow the search (the compiler tags each rule with
   its rarest function name).

   #+begin_src emacs-lisp :results silent
   ;; CRULES must be built with math-compile-rewrites first
   (let ((rules (math-compile-rewrites '(vec (calcFunc-eq (^ a 2) (* a a))))))
     (math-apply-rewrites '(^ x 2) rules nil))  ;; => (* x x)
   #+end_src

** (math-match-patterns) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-match_002dpatterns][manual]]
   =(math-match-patterns PAT VEC NOT-FLAG)=

   Return a new vector of elements from =VEC= that match (or, if =NOT-FLAG= is
   non-nil, don't match) any pattern in =PAT=. =PAT= is an uncompiled pattern
   set or pattern set variable.

   #+begin_src emacs-lisp :results silent
   ;; Keep only elements matching x^n
   (math-match-patterns '(vec (^ a n)) '(vec (^ x 2) x (^ y 3)) nil)
   ;; => (vec (^ x 2) (^ y 3))
   #+end_src

* Solving
** (math-solve-for) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-solve_002dfor][manual]]
   =(math-solve-for LHS RHS VAR FULL)=

   Solve =LHS= = =RHS= for =VAR=, returning the right-hand side, or nil if
   unsolvable. =VAR= must appear in =LHS= or =RHS=. The return value does not
   contain =VAR= (unlike the user-level =solve=/=finv=). If =FULL= is non-nil,
   includes dummy signs and integers.

   #+begin_src emacs-lisp :results silent
   ;; 2x + 3 = 7  =>  x = 2
   (math-solve-for '(+ (* 2 x) 3) 7 'x nil)  ;; => 2
   #+end_src

   Inverses for custom functions are registered via a =math-inverse= property.
   Use =(math-solve-get-sign x)= and =(math-solve-get-int x)= to introduce
   arbitrary sign/integer variables; these return =x= unchanged in non-full mode.

** (math-solve-eqn) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-solve_002deqn][manual]]
   =(math-solve-eqn EXPR VAR FULL)=

   Like =math-solve-for=, but =EXPR= is an equation or inequality. A bare
   expression is treated as =EXPR= = 0. Returns an equation or inequality, or nil.

   #+begin_src emacs-lisp :results silent
   (math-solve-eqn '(calcFunc-eq (+ x 3) 7) 'x nil)  ;; => (calcFunc-eq x 4)
   (math-solve-eqn '(+ x 3) 'x nil)                   ;; => (calcFunc-eq x -3)
   #+end_src

** (math-solve-system) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-solve_002dsystem][manual]]
   =(math-solve-system EXPRS VARS FULL)=

   Solve a system of equations. =EXPRS= and =VARS= are typically equal-length
   vectors.

   #+begin_src emacs-lisp :results silent
   ;; x + y = 3, x - y = 1  =>  x = 2, y = 1
   (math-solve-system '(vec (calcFunc-eq (+ x y) 3)
                            (calcFunc-eq (- x y) 1))
                      '(vec x y) nil)
   ;; => (vec (calcFunc-eq x 2) (calcFunc-eq y 1))
   #+end_src

* Selection
