doc/calc-ref.html
<div id="outline-container-org8eada03" class="outline-3">
<h3 id="org8eada03"><span class="section-number-3">4.2.</span> (math-is-polynomial) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-is_002dpolynomial">manual</a></h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>(math-is-polynomial EXPR VAR DEGREE LOOSE)</code>
</p>

<p>
Return a coefficient list <code>(a0 a1 ... an)</code> for <code>a0 + a1*var + ... + an*var^n</code>,
or nil if <code>EXPR</code> is not a polynomial in <code>VAR</code>. <code>DEGREE</code> caps the maximum
accepted degree (recommended to avoid huge lists on inputs like <code>(x+1)^1000</code>).
</p>

<p>
If <code>LOOSE</code> is non-nil, coefficients may themselves depend on <code>VAR</code> as long
as they are not polynomials; never returns nil in loose mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-is-polynomial '(+ (* 2 x) 3) 'x nil nil)     ;; =&gt; (3 2)      i.e. 3 + 2x
(math-is-polynomial '(+ (^ x 2) -1) 'x nil nil)    ;; =&gt; (-1 0 1)   i.e. -1 + x^2
</pre>
</div>
</div>
</div>
<div id="outline-container-orge1dd8c2" class="outline-3">
<h3 id="orge1dd8c2"><span class="section-number-3">4.3.</span> (math-polynomial-base) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-polynomial_002dbase">manual</a></h3>
<div class="outline-text-3" id="text-4-3">
<p>
<code>(math-polynomial-base EXPR PRED)</code>
</p>

<p>
Return a variable in <code>EXPR</code> such that <code>EXPR</code> is a polynomial in it, or nil.
For multivariate expressions, the choice is arbitrary. <code>PRED</code>, if given, is
called as <code>(pred subexpr)</code> with <code>mpb-top-expr</code> bound to the original <code>EXPR</code>;
use it to add extra conditions or collect all suitable subexpressions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-polynomial-base '(+ (^ x 2) (* 3 x)) nil)  ;; =&gt; x
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org58fe4b6" class="outline-2">
<h2 id="org58fe4b6"><span class="section-number-2">5.</span> Simplification &amp; rewriting</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7a8cc6f" class="outline-3">
<h3 id="org7a8cc6f"><span class="section-number-3">5.1.</span> (math-simplify-extended) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-simplify_002dextended">manual</a></h3>
<div class="outline-text-3" id="text-5-1">
<p>
<code>(math-simplify-extended A)</code>
</p>

<p>
Simplify <code>A</code> with additional rules that are more thorough but not always
safe (e.g., simplifies <code>sqrt(x^2)</code> to <code>x</code>, valid only when <code>x</code> is positive).
Implemented by binding <code>math-living-dangerously</code> to <code>t</code> and calling
<code>math-simplify</code>. Dangerous rules check this variable before firing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-simplify-extended '(calcFunc-sqrt (^ x 2)))  ;; =&gt; x
</pre>
</div>
</div>
</div>
<div id="outline-container-org31538e5" class="outline-3">
<h3 id="org31538e5"><span class="section-number-3">5.2.</span> (math-defsimplify) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-math_002ddefsimplify">manual</a></h3>
<div class="outline-text-3" id="text-5-2">
<p>
<code>(math-defsimplify FUNCS BODY)</code>
</p>

<p>
Macro that registers a simplification rule, typically as a top-level form.
<code>FUNCS</code> is a symbol (e.g., <code>+</code>, <code>calcFunc-sqrt</code>) or list of symbols; the
rule applies to calls to any of those functions. <code>BODY</code> is written as a
function body with <code>expr</code> bound to the matched call.
</p>

<p>
Return nil or the original <code>expr</code> to skip; any other value replaces <code>expr</code>.
Rules are tried in definition order; the first match wins and restarts the
loop. <code>BODY</code> must be plain Lisp — <code>defmath</code> conveniences are not available.
The arguments of the matched call are already simplified before the rule
runs, and may be rearranged destructively.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; arcsinh(-x) =&gt; -arcsinh(x)
(math-defsimplify calcFunc-arcsinh
  (and (math-looks-negp (nth 1 expr))
       (math-neg (list 'calcFunc-arcsinh (math-neg (nth 1 expr))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org569247f" class="outline-3">
<h3 id="org569247f"><span class="section-number-3">5.3.</span> (math-apply-rewrites) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-apply_002drewrites">manual</a></h3>
<div class="outline-text-3" id="text-5-3">
<p>
<code>(math-apply-rewrites EXPR CRULES HEADS)</code>
</p>

<p>
Apply compiled rewrite rule set <code>CRULES</code> to <code>EXPR</code> at the top level only,
making at most one rewrite. Returns the rewritten expression, or nil if no
rule matched or produced a change. <code>HEADS</code> is optional: a list of function
names in <code>EXPR</code> used to narrow the search (the compiler tags each rule with
its rarest function name).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; CRULES must be built with math-compile-rewrites first
(let ((rules (math-compile-rewrites '(vec (calcFunc-eq (^ a 2) (* a a))))))
  (math-apply-rewrites '(^ x 2) rules nil))  ;; =&gt; (* x x)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3cc7a11" class="outline-3">
<h3 id="org3cc7a11"><span class="section-number-3">5.4.</span> (math-match-patterns) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-match_002dpatterns">manual</a></h3>
<div class="outline-text-3" id="text-5-4">
<p>
<code>(math-match-patterns PAT VEC NOT-FLAG)</code>
</p>

<p>
Return a new vector of elements from <code>VEC</code> that match (or, if <code>NOT-FLAG</code> is
non-nil, don't match) any pattern in <code>PAT</code>. <code>PAT</code> is an uncompiled pattern
set or pattern set variable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Keep only elements matching x^n
(math-match-patterns '(vec (^ a n)) '(vec (^ x 2) x (^ y 3)) nil)
;; =&gt; (vec (^ x 2) (^ y 3))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org60ed649" class="outline-2">
<h2 id="org60ed649"><span class="section-number-2">6.</span> Solving</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd2e27a9" class="outline-3">
<h3 id="orgd2e27a9"><span class="section-number-3">6.1.</span> (math-solve-for) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-solve_002dfor">manual</a></h3>
<div class="outline-text-3" id="text-6-1">
<p>
<code>(math-solve-for LHS RHS VAR FULL)</code>
</p>

<p>
Solve <code>LHS</code> = <code>RHS</code> for <code>VAR</code>, returning the right-hand side, or nil if
unsolvable. <code>VAR</code> must appear in <code>LHS</code> or <code>RHS</code>. The return value does not
contain <code>VAR</code> (unlike the user-level <code>solve=/=finv</code>). If <code>FULL</code> is non-nil,
includes dummy signs and integers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; 2x + 3 = 7  =&gt;  x = 2
(math-solve-for '(+ (* 2 x) 3) 7 'x nil)  ;; =&gt; 2
</pre>
</div>

<p>
Inverses for custom functions are registered via a <code>math-inverse</code> property.
Use <code>(math-solve-get-sign x)</code> and <code>(math-solve-get-int x)</code> to introduce
arbitrary sign/integer variables; these return <code>x</code> unchanged in non-full mode.
</p>
</div>
</div>
<div id="outline-container-org85cf828" class="outline-3">
<h3 id="org85cf828"><span class="section-number-3">6.2.</span> (math-solve-eqn) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-solve_002deqn">manual</a></h3>
<div class="outline-text-3" id="text-6-2">
<p>
<code>(math-solve-eqn EXPR VAR FULL)</code>
</p>

<p>
Like <code>math-solve-for</code>, but <code>EXPR</code> is an equation or inequality. A bare
expression is treated as <code>EXPR</code> = 0. Returns an equation or inequality, or nil.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-solve-eqn '(calcFunc-eq (+ x 3) 7) 'x nil)  ;; =&gt; (calcFunc-eq x 4)
(math-solve-eqn '(+ x 3) 'x nil)                   ;; =&gt; (calcFunc-eq x -3)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b24ab2" class="outline-3">
<h3 id="org7b24ab2"><span class="section-number-3">6.3.</span> (math-solve-system) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-solve_002dsystem">manual</a></h3>
<div class="outline-text-3" id="text-6-3">
<p>
<code>(math-solve-system EXPRS VARS FULL)</code>
</p>

<p>
Solve a system of equations. <code>EXPRS</code> and <code>VARS</code> are typically equal-length
vectors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; x + y = 3, x - y = 1  =&gt;  x = 2, y = 1
(math-solve-system '(vec (calcFunc-eq (+ x y) 3)
                         (calcFunc-eq (- x y) 1))
                   '(vec x y) nil)
;; =&gt; (vec (calcFunc-eq x 2) (calcFunc-eq y 1))
</pre>
</div>
</div>
</div>
</div>
