doc/calc-ref.org
** (calc-prepare-selection) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dprepare_002dselection][manual]]
   =(calc-prepare-selection &optional NUM)=

   Prepare a stack entry for selection operations. =NUM= specifies which entry
   to use; if omitted, the entry containing the cursor is used.

   Stores results in: =calc-selection-cache-num= (the entry number used),
   =calc-selection-cache-entry= (the entry as a list, as =calc-top-list= would
   return with entry as the selection mode), and =calc-selection-cache-comp=
   (a "tagged" composition mapping cursor positions to sub-formulas; see I/O
   and Formatting Functions).

   A complication: formulas can contain duplicate small integers. In =[1, 2, 1]=,
   both =1=s are =eq= in Lisp, so storing =1= as a selection would falsely match
   both. To prevent this, =calc-prepare-selection= replaces plain integers with
   =(cplx n 0)= lists — displayed identically but distinct objects, so no two
   sub-formulas are =eq=. The next time the entry is used in a computation,
   =calc-normalize= restores them to plain numbers.

   #+begin_src emacs-lisp :results silent
   (calc-prepare-selection)    ;; prepare entry under cursor
   (calc-prepare-selection 2)  ;; prepare stack entry 2
   #+end_src

** (calc-find-selected-part) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dfind_002dselected_002dpart][manual]]
   =(calc-find-selected-part)=

   Find the smallest sub-formula containing the cursor. Assumes
   =calc-prepare-selection= has been called first. Returns nil if the cursor
   is not on any part of the formula.

   #+begin_src emacs-lisp :results silent
   (calc-prepare-selection)
   (calc-find-selected-part)  ;; => sub-formula under cursor, or nil
   #+end_src

** (calc-find-sub-formula) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dfind_002dsub_002dformula][manual]]
   =(calc-find-sub-formula EXPR PART)=

   Search =EXPR= for =PART= by object identity (=eq=). Returns:
   - =t= — =EXPR= itself is =PART=
   - N — =PART= is found within the Nth argument of =EXPR= (1-based)
   - =nil= — =PART= is not in =EXPR=

   The index N can be passed to =calc-find-nth-part= to retrieve the child.
   Does not account for associativity.

   #+begin_src emacs-lisp :results silent
   (let* ((expr '(+ a (* b c)))
          (sub  (nth 2 expr)))            ;; (* b c)
     (calc-find-sub-formula expr sub))    ;; => 2
   #+end_src

** (calc-locate-cursor-element)
   =(calc-locate-cursor-element PT)=

   Return the stack index of the entry whose display region contains buffer
   position =PT=. The result is suitable for passing to =calc-cursor-stack-index=.

   #+begin_src emacs-lisp :results silent
   (calc-locate-cursor-element (point))  ;; => stack index at cursor position
   #+end_src

* Display
** (math-format-value) [[https://www.gnu.org/software/emacs/manual/html_node/calc/Formatting-Lisp-Functions.html#index-format_002dvalue][manual]]
   =(math-format-value A &optional W)=

   Format =A= as a display string. For plain scalars in nil/flat/unform language
   modes, delegates to =math-format-number=. Otherwise composes =A= and converts
   to string via =math-composition-to-string= with no line breaking. =W=
   optionally limits the output width.

   #+begin_src emacs-lisp :results silent
   (math-format-value '(+ x 1))   ;; => "x + 1"
   (math-format-value '(^ x 2))   ;; => "x^2"
   #+end_src

** (math-format-stack-value)
   =(math-format-stack-value ENTRY)=

   Format a complete stack entry for display in the Calc buffer. =ENTRY= is a
   list =(value lines selection)=. Handles selection highlighting, left label
   (=calc-left-label=), and line numbering (=calc-line-numbering=). Sets
   =calc-selection-cache-entry= and =calc-any-selections= as side effects.

   #+begin_src emacs-lisp :results silent
   ;; ENTRY format: (value display-lines selection)
   (math-format-stack-value (list '(+ x 1) nil nil))
   #+end_src

** (calc-align-stack-window)
   =(calc-align-stack-window)=

   Scroll the Calc stack window so the home line (.) is visible near the
   bottom. Positions the window start accordingly and moves point to the home
   line. If called from outside the Calc buffer, switches to it first.

   #+begin_src emacs-lisp :results silent
   (calc-align-stack-window)
   #+end_src
