doc/calc-ref.html
<div id="outline-container-org1c5fc6c" class="outline-2">
<h2 id="org1c5fc6c"><span class="section-number-2">7.</span> Selection</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgcb7f78a" class="outline-3">
<h3 id="orgcb7f78a"><span class="section-number-3">7.1.</span> (calc-prepare-selection) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dprepare_002dselection">manual</a></h3>
<div class="outline-text-3" id="text-7-1">
<p>
<code>(calc-prepare-selection &amp;optional NUM)</code>
</p>

<p>
Prepare a stack entry for selection operations. <code>NUM</code> specifies which entry
to use; if omitted, the entry containing the cursor is used.
</p>

<p>
Stores results in: <code>calc-selection-cache-num</code> (the entry number used),
<code>calc-selection-cache-entry</code> (the entry as a list, as <code>calc-top-list</code> would
return with entry as the selection mode), and <code>calc-selection-cache-comp</code>
(a "tagged" composition mapping cursor positions to sub-formulas; see I/O
and Formatting Functions).
</p>

<p>
A complication: formulas can contain duplicate small integers. In <code>[1, 2, 1]</code>,
both <code>1=s are =eq</code> in Lisp, so storing <code>1</code> as a selection would falsely match
both. To prevent this, <code>calc-prepare-selection</code> replaces plain integers with
<code>(cplx n 0)</code> lists — displayed identically but distinct objects, so no two
sub-formulas are <code>eq</code>. The next time the entry is used in a computation,
<code>calc-normalize</code> restores them to plain numbers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-prepare-selection)    ;; prepare entry under cursor
(calc-prepare-selection 2)  ;; prepare stack entry 2
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc008489" class="outline-3">
<h3 id="orgc008489"><span class="section-number-3">7.2.</span> (calc-find-selected-part) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dfind_002dselected_002dpart">manual</a></h3>
<div class="outline-text-3" id="text-7-2">
<p>
<code>(calc-find-selected-part)</code>
</p>

<p>
Find the smallest sub-formula containing the cursor. Assumes
<code>calc-prepare-selection</code> has been called first. Returns nil if the cursor
is not on any part of the formula.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-prepare-selection)
(calc-find-selected-part)  ;; =&gt; sub-formula under cursor, or nil
</pre>
</div>
</div>
</div>
<div id="outline-container-org372a66e" class="outline-3">
<h3 id="org372a66e"><span class="section-number-3">7.3.</span> (calc-find-sub-formula) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Symbolic-Lisp-Functions.html#index-calc_002dfind_002dsub_002dformula">manual</a></h3>
<div class="outline-text-3" id="text-7-3">
<p>
<code>(calc-find-sub-formula EXPR PART)</code>
</p>

<p>
Search <code>EXPR</code> for <code>PART</code> by object identity (<code>eq</code>). Returns:
</p>
<ul class="org-ul">
<li><code>t</code> — <code>EXPR</code> itself is <code>PART</code></li>
<li>N — <code>PART</code> is found within the Nth argument of <code>EXPR</code> (1-based)</li>
<li><code>nil</code> — <code>PART</code> is not in <code>EXPR</code></li>
</ul>

<p>
The index N can be passed to <code>calc-find-nth-part</code> to retrieve the child.
Does not account for associativity.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(let* ((expr '(+ a (* b c)))
       (sub  (nth 2 expr)))            ;; (* b c)
  (calc-find-sub-formula expr sub))    ;; =&gt; 2
</pre>
</div>
</div>
</div>
<div id="outline-container-org3608845" class="outline-3">
<h3 id="org3608845"><span class="section-number-3">7.4.</span> (calc-locate-cursor-element)</h3>
<div class="outline-text-3" id="text-7-4">
<p>
<code>(calc-locate-cursor-element PT)</code>
</p>

<p>
Return the stack index of the entry whose display region contains buffer
position <code>PT</code>. The result is suitable for passing to <code>calc-cursor-stack-index</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-locate-cursor-element (point))  ;; =&gt; stack index at cursor position
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org811f16d" class="outline-2">
<h2 id="org811f16d"><span class="section-number-2">8.</span> Display</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org1ac94c9" class="outline-3">
<h3 id="org1ac94c9"><span class="section-number-3">8.1.</span> (math-format-value) <a href="https://www.gnu.org/software/emacs/manual/html_node/calc/Formatting-Lisp-Functions.html#index-format_002dvalue">manual</a></h3>
<div class="outline-text-3" id="text-8-1">
<p>
<code>(math-format-value A &amp;optional W)</code>
</p>

<p>
Format <code>A</code> as a display string. For plain scalars in nil/flat/unform language
modes, delegates to <code>math-format-number</code>. Otherwise composes <code>A</code> and converts
to string via <code>math-composition-to-string</code> with no line breaking. <code>W</code>
optionally limits the output width.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(math-format-value '(+ x 1))   ;; =&gt; "x + 1"
(math-format-value '(^ x 2))   ;; =&gt; "x^2"
</pre>
</div>
</div>
</div>
<div id="outline-container-org101c201" class="outline-3">
<h3 id="org101c201"><span class="section-number-3">8.2.</span> (math-format-stack-value)</h3>
<div class="outline-text-3" id="text-8-2">
<p>
<code>(math-format-stack-value ENTRY)</code>
</p>

<p>
Format a complete stack entry for display in the Calc buffer. <code>ENTRY</code> is a
list <code>(value lines selection)</code>. Handles selection highlighting, left label
(<code>calc-left-label</code>), and line numbering (<code>calc-line-numbering</code>). Sets
<code>calc-selection-cache-entry</code> and <code>calc-any-selections</code> as side effects.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; ENTRY format: (value display-lines selection)
(math-format-stack-value (list '(+ x 1) nil nil))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge8c8f72" class="outline-3">
<h3 id="orge8c8f72"><span class="section-number-3">8.3.</span> (calc-align-stack-window)</h3>
<div class="outline-text-3" id="text-8-3">
<p>
<code>(calc-align-stack-window)</code>
</p>

<p>
Scroll the Calc stack window so the home line (.) is visible near the
bottom. Positions the window start accordingly and moves point to the home
line. If called from outside the Calc buffer, switches to it first.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(calc-align-stack-window)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Yeung</p>
<p class="date">Created: 2026-05-25 Mon 15:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
